Бухгалтерские_задачи_по_методичке/src/Documents/КорректировкаСтоимостиНоменклатуры/КорректировкаСтоимостиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаСтоимостиНоменклатуры</name>
  <registerRecords>AccountingRegister.Проводки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Document>

Бухгалтерские_задачи_по_методичке/src/AccountingRegisters/Проводки/Проводки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Проводки</name>
  <chartOfAccounts>ChartOfAccounts.Бухгалтерский</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Бухгалтерский.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.Валютный</accountingFlag>
  </resources>
  <resources>
    <name>СуммаХолдинга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Бухгалтерский.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

Бухгалтерские_задачи_по_методичке/src/ChartsOfAccounts/Бухгалтерский/Бухгалтерский.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Бухгалтерский</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Активы</name>
      <description>Активы</description>
      <code>1</code>
      <childItems>
        <name>Касса</name>
        <description>Касса</description>
        <code>1.1</code>
      </childItems>
      <childItems>
        <name>Покупатели</name>
        <description>Покупатели</description>
        <code>1.2</code>
      </childItems>
      <childItems>
        <name>Товары</name>
        <description>Товары</description>
        <code>1.3</code>
      </childItems>
    </items>
    <items>
      <name>Обязательства</name>
      <description>Обязательства</description>
      <code>2</code>
      <accountType>Passive</accountType>
      <childItems>
        <name>Сотрудники</name>
        <description>Сотрудники</description>
        <code>2.1</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Поставщики</name>
        <description>Поставщики</description>
        <code>2.2</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>Капитал</name>
      <description>Капитал</description>
      <code>3</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>ТоварыНаХранении</name>
      <description>Товары на хранении</description>
      <code>6</code>
      <offBalance>true</offBalance>
    </items>
  </predefined>
  <attributes>
    <name>ЗапретитьИспользоватьВПроводках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <accountingFlags>
    <name>УчетПоПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

Бухгалтерские_задачи_по_методичке/src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>CatalogRef.Субконто</types>
    <types>CatalogRef.Договоры</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.Контрагенты</types>
  </type>
  <predefined>
    <items>
      <name>Договоры</name>
      <description>Договоры</description>
      <code>000000005</code>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </items>
    <items>
      <name>Контрагенты</name>
      <description>Контрагенты</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>Склады</name>
      <description>Склады</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>Сотруднкики</name>
      <description>Сотруднкики</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

Бухгалтерские_задачи_по_методичке/src/Documents/КорректировкаСтоимостиНоменклатуры/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.Проводки.Записать();

	Если (Константы.УчетПоСкладам.Получить() = Истина) Тогда
		ОбработкаПроведенияУчетПоСкладам(Отказ, РежимПроведения);
	Иначе
		ОбработкаПроведенияНетУчетаПоСкладам(Отказ, РежимПроведения);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведенияУчетПоСкладам(Отказ, РежимПроведения)

	Если (Константы.СуммовойУчетПоСкладам.Получить() = Ложь) Тогда
		
		ОбработкаПроведенияНетУчетаПоСкладам(Отказ, РежимПроведения);
		//Корректировать себестоимость с учетом складов нет смысла
		
		Возврат;
		
	КонецЕсли;


	Движения.Проводки.Записывать = Истина;

	Запрос = Новый Запрос; 

	ВидыСубконто = Новый Массив; 
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Склады);

	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата2", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Дата1", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);

	Запрос.Текст = "ВЫБРАТЬ
		|	ПроводкиОстаткиИОбороты.Субконто1 КАК Номенклатура,
		|	ПроводкиОстаткиИОбороты.Субконто2 КАК Склад,
		|	ПроводкиОстаткиИОбороты.Счет,
		|	ПроводкиОстаткиИОбороты.Подразделение КАК Подразделение,
		|	ПроводкиОстаткиИОбороты.СуммаНачальныйОстатокДт,
		|	ПроводкиОстаткиИОбороты.СуммаОборотДт,
		|	ПроводкиОстаткиИОбороты.СуммаОборотКт,
		|	ПроводкиОстаткиИОбороты.КоличествоНачальныйОстатокДт,
		|	ПроводкиОстаткиИОбороты.КоличествоОборотДт,
		|	ПроводкиОстаткиИОбороты.КоличествоОборотКт
		|ИЗ
		|	РегистрБухгалтерии.Проводки.ОстаткиИОбороты(&Дата1, &Дата2,,,,
		|		&ВидыСубконто, Организация = &Организация) КАК ПроводкиОстаткиИОбороты
		|ИТОГИ
		|ПО
		|	Склад,
		|	Подразделение,
		|	Номенклатура";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаСклад = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаСклад.Следующий() Цикл

		ВыборкаПодразделение = ВыборкаСклад.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Пока ВыборкаПодразделение.Следующий() Цикл

			ВыборкаНоменклатура = ВыборкаПодразделение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

			Пока ВыборкаНоменклатура.Следующий() Цикл

				ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();

				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

					СреднеВзвешеннаяЦена = (ВыборкаДетальныеЗаписи.СуммаНачальныйОстатокДт
						+ ВыборкаДетальныеЗаписи.СуммаОборотДт)
						/ (ВыборкаДетальныеЗаписи.КоличествоНачальныйОстатокДт
						+ ВыборкаДетальныеЗаписи.КоличествоОборотДт);

					РазницаВСтоимости = ВыборкаДетальныеЗаписи.КоличествоОборотДт
						* СреднеВзвешеннаяЦена - ВыборкаДетальныеЗаписи.СуммаОборотКт;

					Если (ВыборкаДетальныеЗаписи.КоличествоОборотКт > 0
							И РазницаВСтоимости <> 0) Тогда

						Движение = Движения.Проводки.Добавить();
						Движение.СчетДт = ПланыСчетов.Бухгалтерский.Капитал;
						Движение.СчетКт = ПланыСчетов.Бухгалтерский.Товары;

						БухгалтерияСервер.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
						БухгалтерияСервер.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.Склад);

						Движение.КоличествоКт = 0;

						Движение.Период = Дата;
						Движение.Сумма = РазницаВСтоимости;
						Движение.Организация = Организация;
						Движение.Содержание = "Корректировка стоимости номенклатуры";

						БухгалтерияСервер.УстановитьПодразделенияПроводки(Движение, ВыборкаДетальныеЗаписи.Подразделение, ВыборкаДетальныеЗаписи.Подразделение);

					КонецЕсли;

				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаПроведенияНетУчетаПоСкладам(Отказ, РежимПроведения)

	Движения.Проводки.Записывать = Истина;

	Запрос = Новый Запрос;

	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);

	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата2", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Дата1", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);

	Запрос.Текст = "ВЫБРАТЬ
		|	ПроводкиОстаткиИОбороты.Субконто1 КАК Номенклатура,
		|	ПроводкиОстаткиИОбороты.Счет,
		|	ПроводкиОстаткиИОбороты.Подразделение КАК Подразделение,
		|	ПроводкиОстаткиИОбороты.СуммаНачальныйОстатокДт,
		|	ПроводкиОстаткиИОбороты.СуммаОборотДт,
		|	ПроводкиОстаткиИОбороты.СуммаОборотКт,
		|	ПроводкиОстаткиИОбороты.КоличествоНачальныйОстатокДт,
		|	ПроводкиОстаткиИОбороты.КоличествоОборотДт,
		|	ПроводкиОстаткиИОбороты.КоличествоОборотКт
		|ИЗ
		|	РегистрБухгалтерии.Проводки.ОстаткиИОбороты(&Дата1, &Дата2,,,,
		|		&ВидыСубконто, Организация = &Организация) КАК ПроводкиОстаткиИОбороты
		|ИТОГИ
		|ПО
		|	Подразделение,
		|	Номенклатура";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаПодразделение = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаПодразделение.Следующий() Цикл

		ВыборкаНоменклатура = ВыборкаПодразделение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Пока ВыборкаНоменклатура.Следующий() Цикл

			ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();

			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

				СреднеВзвешеннаяЦена = (ВыборкаДетальныеЗаписи.СуммаНачальныйОстатокДт
					+ ВыборкаДетальныеЗаписи.СуммаОборотДт)
					/ (ВыборкаДетальныеЗаписи.КоличествоНачальныйОстатокДт
					+ ВыборкаДетальныеЗаписи.КоличествоОборотДт);

				РазницаВСтоимости = ВыборкаДетальныеЗаписи.КоличествоОборотДт
					* СреднеВзвешеннаяЦена - ВыборкаДетальныеЗаписи.СуммаОборотКт;

				Если (ВыборкаДетальныеЗаписи.КоличествоОборотКт > 0
						И РазницаВСтоимости <> 0) Тогда

					Движение = Движения.Проводки.Добавить();
					Движение.СчетДт = ПланыСчетов.Бухгалтерский.Капитал;
					Движение.СчетКт = ПланыСчетов.Бухгалтерский.Товары;

					БухгалтерияСервер.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);

					Движение.КоличествоКт = 0;

					Движение.Период = Дата;
					Движение.Сумма = РазницаВСтоимости;
					Движение.Организация = Организация;
					Движение.Содержание = "Корректировка стоимости номенклатуры";

					БухгалтерияСервер.УстановитьПодразделенияПроводки(Движение, ВыборкаДетальныеЗаписи.Подразделение, ВыборкаДетальныеЗаписи.Подразделение);

				КонецЕсли;

			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры
